export const Rules = {
  // 中文输入
  chineseWord: /^([\u4e00-\u9fa5])+$/,
  // 常规字符输入
  normalWord: /^([\u4e00-\u9fa5-a-zA-Z0-9_-—])+$/,
  // 邮箱校验
  email: /^([a-zA-Z0-9._-])+@([a-zA-Z0-9_-])+(?:\.[0-9A-Za-z]+)+$/,
  // 电话号码格式校验
  phone: /^((13[0-9])|(14[0-9])|(15[0-9])|(16[0-9])|(17[0-9])|(18[0-9])|(19[0-9]))\d{8}$/,
  // 大于0，最多保留两位小数
  fix2: /^([1-9]\d*$)|([1-9]\d*\.(\d{1,2})$)|(0\.((0[1-9])|([1-9]\d?))$)/,
  // 正数
  positive: /(^0\.0*[1-9]+[0-9]*$)|(^[1-9]\d*(\.\d+)?$)/,
  // 正整数
  positiveInteger: /^[1-9]\d*$/,
  // 正数或0
  notNegtive: /^\d*(\.\d+)?$/,
  // 正整数或0
  notNegtiveInteger: /^\d*$/,
  // 输入0.01-0.1（含）之间，最多可输入五位小数
  rate: /^0\.0[1-9]\d{0,3}$|^0\.10{0,4}$/,
  // 输入0-0.1（含）之间，最多可输入五位小数
  rate2: /^0(\.0\d{0,4})?$|^0\.10{0,4}$/,
  // 金额最多两位小数
  amount: /(^[1-9](\d+)?(\.\d{1,2})?$)|(^\d\.\d{1,2}$)/,
  // 1-100百分比 最多两位小数
  percent: /^100$|^([1-9]|[1-9]\d)(\.\d{1,2})*$/,
  // 整数千分位 '13456789'.replace(reg,'$1,')
  thousandth: /(\d{1,3})(?=(\d{3})+$)/g,
  // 小数加千分位  '1253456789.89'.replace(reg,'$1,')
  thousandthWithPoint: /(\d{1,3})(?=(\d{3})+(\.|$))/g
};
